function z = quarternionParameter(x)
%QUORTERNIONPARAMETER クォータニオンをパラメータとして含む観測量
%   Z = quartanionParameter(X)
%   X : [位置P; クォータニオンQ; 速度V; 角速度W]を持つ12次元の状態量
%   Z : [X; (クォータニオンを含む項) ]

P1 = x(1,1);
P2 = x(2,1);
P3 = x(3,1);
q0 = x(4,1);
q1 = x(5,1);
q2 = x(6,1);
q3 = x(7,1);
V1 = x(8,1);
V2 = x(9,1);
V3 = x(10,1);
W1 = x(11,1);
W2 = x(12,1);
W3 = x(13,1);

% % 発散 下のよりはまし 20221110 10^9オーダー
% z = [P1;P2;P3;q0;q1;q2;q3;V1;V2;V3;W1;W2;W3;
%     -W1*q1/2-W2*q2/2-W3*q3/2;
%      W1*q0/2-W2*q3/2+W3*q2/2;
%      W2*q0/2+W1*q3/2-W3*q1/2;
%      W2*q1/2-W1*q2/2+W3*q1/2];

% 発散 20221110 10^54オーダー
z = [P1;P2;P3;q0;q1;q2;q3;V1;V2;V3;W1;W2;W3;
    -W1*q1/2;
    -W2*q2/2;
    -W3*q3/2;
     W1*q0/2;
    -W2*q3/2;
     W3*q2/2;
     W2*q0/2;
     W1*q3/2;
    -W3*q1/2;
     W2*q1/2;
    -W1*q2/2;
     W3*q1/2];

% チェック用
% z = [P1;P2;P3;q0;q1;q2;q3;V1;V2;V3;W1;W2;W3];

end

